app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "0 to 1"], ["name", "0 to one "], ["created_at", "2019-01-17 23:22:18.633752"], ["updated_at", "2019-01-17 23:22:18.633752"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "vsvs"], ["updated_at", "2019-01-18 15:06:20.847072"], ["id", 1]]